[
  {
    "id": 1,
    "title": "Mixer",
    "subtitle": "Mixing console built with TypeScript, Svelte and Tone.js.",
    "slug": "mixer",
    "image": "../images/projects/mixer.jpg",
    "color": "#ffa300",
    "link": "https://mixer.adamheldring.com/",
    "repo": "https://github.com/adamheldring/mixer/",
    "description": "💻 A playful mixing console built in TypeScript and Svelte. The audio chain is produced utilizing Tone.js and the Web Audio API. Five instrument channels with individual controls and meters are connected to one master bus that controls and displays the summed up audio output. Each channel can be switched off and on, as well as toggled between an original and alternate track representing that instrument.<br/><br/> 🎧 Press play and start modifying the sounds and settings of this song. I had this idea for some time of a recording where the listener could mute or switch out certain instruments to their own liking as they go. And I thought the layout of a mixing console would be a suiting representation. I started by creating and recording the ten different audio tracks and then switched back to code. The key challenge here is to always keep the tracks in sync no matter how the user toggles or modifies the track. It worked out nicely and was a fun build. I wanted a minimalistic and \"non-musician friendly\" interface but this console could easily be extended with equalizer controls and effects etc.",
    "tech": {
      "code": [
        "TypeScript",
        "Svelte",
        "SvelteKit",
        "Tone.js",
        "Web Audio API",
        "TailwindCSS",
        "HTML5"
      ],
      "toolbox": ["VSCode", "Logic Pro X", "iTerm2", "GitHub", "Trello"],
      "more": [
        "Music production",
        "Audio Composition",
        "Concept development",
        "Design"
      ]
    }
  },
  {
    "id": 2,
    "title": "Watch Your Tone",
    "subtitle": "Synth & drum sequenser built in React and Node using the Web Audio API. ",
    "slug": "watch-your-tone",
    "image": "../images/projects/watchyourtone.jpg",
    "color": "#ca7acf",
    "link": "https://watchyourtone.onrender.com/",
    "repo": "https://github.com/adamheldring/WatchYourTone",
    "description": "💻 A web synth with drum machine (…or really a 16-bar step sequenser) built in JavaScript. React in the front-end on top of Node and Express in the back-end talking to a MongoDB database. Exploring the Web Audio API and Tone.js. Matched with a retro design.<br/><br/> 🥁 Press play and start clicking the squares for synth notes and circles for drums. This instrument is meant to be played with and you don't have to be a musician. Make a song and save it to the database. Or load someone elses song for inspiration!",
    "tech": {
      "code": [
        "JavaScript ES6",
        "React",
        "Node",
        "Express",
        "Mongo DB",
        "Web Audio API",
        "Tone.js",
        "HTML5",
        "CSS3",
        "JSX"
      ],
      "toolbox": [
        "VSCode",
        "iTerm2",
        "Postman",
        "Compass",
        "GitHub",
        "Adobe Photoshop",
        "Trello"
      ],
      "more": ["Concept development", "Design"]
    }
  },
  {
    "id": 3,
    "title": "adamheldring.com",
    "subtitle": "Band marketing page built with React, Gatsby, GraphQL and Spring animations.",
    "slug": "ah2019",
    "image": "../images/projects/ah2019.jpg",
    "color": "#E35371",
    "link": "https://www.adamheldring.com",
    "repo": "https://github.com/adamheldring/AH2019",
    "description": "💻 Responsive and blazing fast artist page built with React and Gatsby for static site generation. Using a GraphQL API for data loading and React Spring for physics based animations. Integrated Spotify and YouTube players.<br/><br/> 🎸 Yes, I also make music and release records. This is a real website for my very real music endeavors. But is the music any good? Well, there's a time to be modest and a time to be honest. So... YES, this music is awesome!",
    "tech": {
      "code": [
        "JavaScript ES6",
        "React",
        "Gatsby",
        "GraphQL",
        "React Spring Animations",
        "HTML5",
        "CSS3",
        "JSX",
        "Spotify integration",
        "YouTube integration"
      ],
      "toolbox": ["VSCode", "iTerm2", "GitHub", "Adobe Photoshop", "Trello"],
      "more": [
        "Concept development",
        "Design",
        "Music Production",
        "Video Production"
      ]
    }
  },
  {
    "id": 4,
    "title": "Board Game Grid",
    "subtitle": "Game board with drag'n'drop for physical real world board games built with React.",
    "slug": "board-game-grid",
    "image": "../images/projects/rpggrid.jpg",
    "color": "#5fc2fb",
    "link": "https://adamheldring.github.io/RpgGrid/",
    "repo": "https://github.com/adamheldring/RpgGrid",
    "description": "💻 Drag'n'drop based board game grid to be used as a digital tool for real world board games. Built with React, CSS Grid and ReactDnD. Intended for use with medium to large size touch screens where physical board game figures and markers can be moved around.<br/><br/>🎲 I've been playing Dungeons and Dragons with my childhood friends (#nobrag #noshame) for more than 20 years but with a 15 year gap. And when we unpacked the box after 15 years – the plastic battle figures still looked awesome but the fold-out paper board that came with the game suddenly seemed useless. We did however have a large size touch screen that we could lay flat on the table, so my mind wandered straight to code. And that's the story behind this odd digital retro board game grid that still relies on real world figures and markers.",
    "tech": {
      "code": [
        "JavaScript ES6",
        "React",
        "HTML5",
        "CSS3",
        "CSS Grid",
        "React DnD"
      ],
      "toolbox": ["VSCode", "iTerm2", "GitHub", "Adobe Photoshop", "Trello"],
      "more": ["Concept development", "Design"]
    }
  },
  {
    "id": 5,
    "title": "Who's Turn",
    "subtitle": "Who's Turn – order rotation tracker built in pure vanilla JavaScript, HTML and CSS.",
    "slug": "whos-turn",
    "image": "../images/projects/whosturn.jpg",
    "color": "#11aa11",
    "link": "http://vemstips.adamheldring.com/",
    "repo": "https://github.com/adamheldring/vemstips",
    "description": "💻 Straight-forward and useful single-purpose order rotation tracker app that keeps track of a list of players and states who's turn it is this week. Just for flavor it also counts down the days and turns red on game day. Built in pure vanilla JavaScript.<br/><br/> 💚 This might be a simple website but I hold it very dear and I actively use it every week. For me it's a great example of how a little code can really make your life easier. Every week – my dad, my brother and I take turns placing bets on the Saturday soccer games. Then we all follow the games, cheer and make fun of each others teams via chat. Classic family stuff I guess and a great way to keep in touch no matter what else is going on that weekend. But every week there was always a big fuzz about who’s turn it really was to place the bets. Until I finally made this little app to settle the question once and for all.",
    "tech": {
      "code": ["JavaScript ES6", "HTML5", "CSS3"],
      "toolbox": ["VSCode", "GitHub"],
      "more": ["Design"]
    }
  },
  {
    "id": 6,
    "title": "Radio Player",
    "subtitle": "Radio player built in React and JavaScript ES6 with Sveriges Radio's open API.",
    "slug": "radio-player",
    "image": "../images/projects/radioplayer.jpg",
    "color": "#EF652B",
    "link": "https://adamheldring.github.io/RadioPlayer/",
    "repo": "https://github.com/adamheldring/RadioPlayer/",
    "description": "💻 Responsive Radio Player built in React and JavaScript ES6. Bringing in streaming live radio using Sveriges Radio’s open API. A search field lets the user filter channels by subtitle and description.<br/><br/> 📻 Clicking the old radio in desktop mode gives the site a retro look, and the clickable icon up on the right is a tip of the hat to another radio themed culture phenomenon.",
    "tech": {
      "code": [
        "JavaScript ES6",
        "React",
        "HTML5",
        "CSS3",
        "JSX",
        "SR Open API"
      ],
      "toolbox": [
        "Atom",
        "GitHub",
        "Postman",
        "Adobe Photoshop",
        "iTerm2",
        "Trello"
      ],
      "more": ["Concept development", "Agile methodology"]
    }
  }
]
